controllers/StudentController.php

    protected function findModel($id)
    {
        if (($model = Student::findOne(['id' => $id])) !== null) {
---
SELECT * FROM `student` WHERE `id`='18'