models/Student.php

SELECT `title` FROM `course` WHERE `id` IN ('1', '2', '3', '4')
---
 public function getCourseTitles()
    {
        $courseIds = explode(',', $this->course_books);

        $query = Course::find()->select('title')->where(['id' => $courseIds]);

SELECT `title` FROM `subject` WHERE `id`='1'
---
 public function getSubjectTitles()
    {
        $subjectIds = explode(',', $this->subject);

        $query = Subject::find()->select('title')->where(['id' => $subjectIds]);